src/test/testtool/ZoekMetPostcodeEnHuisnummer/01/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:StUF="http://www.egem.nl/StUF/StUF0301">
	<soapenv:Body>
		<BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310"
			xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310"
			xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:xlink="http://www.w3.org/1999/xlink"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<BG:stuurgegevens>
				<StUF:berichtcode>La01</StUF:berichtcode>
				<StUF:zender>
					<StUF:organisatie>test</StUF:organisatie>
					<StUF:applicatie>test123</StUF:applicatie>
				</StUF:zender>
				<StUF:ontvanger>
					<StUF:organisatie />
					<StUF:applicatie>DEC_ZKN</StUF:applicatie>
					<StUF:gebruiker>TEST</StUF:gebruiker>
				</StUF:ontvanger>
				<StUF:tijdstipBericht>20241015062822722</StUF:tijdstipBericht>
				<StUF:crossRefnummer>25893868-0eb9-4a47-a055-260dfc1e7ed9</StUF:crossRefnummer>
				<StUF:entiteittype>NPS</StUF:entiteittype>
			</BG:stuurgegevens>
			<BG:parameters>
				<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
				<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
				<StUF:aantalVoorkomens>3</StUF:aantalVoorkomens>
			</BG:parameters>
			<BG:antwoord>
				<BG:object StUF:entiteittype="NPS">
					<BG:inp.bsn>999990639</BG:inp.bsn>
					<BG:inp.a-nummer xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:geslachtsnaam>Burck</BG:geslachtsnaam>
					<BG:voorvoegselGeslachtsnaam>du</BG:voorvoegselGeslachtsnaam>
					<BG:voorletters>M.</BG:voorletters>
					<BG:voornamen>Mattheus</BG:voornamen>
					<BG:aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend"/>
					<BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
					<BG:geboortedatum>19220925</BG:geboortedatum>
					<BG:inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:sub.verblijfBuitenland>
						<BG:lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:sub.adresBuitenland1 xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:sub.adresBuitenland2 xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:sub.adresBuitenland3 xsi:nil="true" StUF:noValue="waardeOnbekend" />
					</BG:sub.verblijfBuitenland>
					<BG:sub.correspondentieAdres />
					<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.burgerlijkeStaat>1</BG:inp.burgerlijkeStaat>
					<BG:inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.datumInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.immigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:ing.indicatieGezagMinderjarige xsi:nil="true"
						StUF:noValue="nietGeautoriseerd" />
					<BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
				</BG:object>
				<BG:object StUF:entiteittype="NPS">
					<BG:inp.bsn>999993161</BG:inp.bsn>
					<BG:inp.a-nummer xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:geslachtsnaam>Maassen</BG:geslachtsnaam>
					<BG:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:voorletters>P.J.H.</BG:voorletters>
					<BG:voornamen>Pieter Jozef Hubert</BG:voornamen>
					<BG:aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
					<BG:geboortedatum>18980102</BG:geboortedatum>
					<BG:inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:sub.verblijfBuitenland>
						<BG:lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:sub.adresBuitenland1 xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:sub.adresBuitenland2 xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:sub.adresBuitenland3 xsi:nil="true" StUF:noValue="waardeOnbekend" />
					</BG:sub.verblijfBuitenland>
					<BG:sub.correspondentieAdres />
					<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.burgerlijkeStaat>1</BG:inp.burgerlijkeStaat>
					<BG:inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.datumInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.immigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:ing.indicatieGezagMinderjarige xsi:nil="true"
						StUF:noValue="nietGeautoriseerd" />
					<BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
				</BG:object>
				<BG:object StUF:entiteittype="NPS">
					<BG:inp.bsn>999991590</BG:inp.bsn>
					<BG:inp.a-nummer xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:geslachtsnaam>Pluis</BG:geslachtsnaam>
					<BG:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:voorletters>M.G.</BG:voorletters>
					<BG:voornamen>Maria Gertrudis</BG:voornamen>
					<BG:aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
					<BG:geboortedatum>18990404</BG:geboortedatum>
					<BG:inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:sub.verblijfBuitenland>
						<BG:lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:sub.adresBuitenland1 xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:sub.adresBuitenland2 xsi:nil="true" StUF:noValue="waardeOnbekend" />
						<BG:sub.adresBuitenland3 xsi:nil="true" StUF:noValue="waardeOnbekend" />
					</BG:sub.verblijfBuitenland>
					<BG:sub.correspondentieAdres />
					<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.burgerlijkeStaat>1</BG:inp.burgerlijkeStaat>
					<BG:inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.datumInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.immigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
					<BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
					<BG:ing.indicatieGezagMinderjarige xsi:nil="true"
						StUF:noValue="nietGeautoriseerd" />
					<BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
				</BG:object>
			</BG:antwoord>
		</BG:npsLa01>
	</soapenv:Body>
</soapenv:Envelope>